"""
マス目の経路最適化 (2)
(https://algo-method.com/tasks/2925Drvr)

いくつかのマスを選んで黒く塗る＝塗り方の方法を考える

直前の列のつながりだけ分かればいい（過去全部の盤面は不要）
直前列の塗り方を考える
1列の塗り方は何通り？？
2行×2（黒白）＝４通り

# 状態一覧（上、下）
# 0 : (白, 白)
# 1 : (白, 黒)
# 2 : (黒, 白)
# 3 : (黒, 黒)
"""

N = int(input())
A = list(map(int, input().split()))
B = list(map(int, input().split()))
INF = 10**9

# i 列目の塗り方を持つ
dp = [[INF for _ in range(4)] for _ in range(N)]

# dp初期条件
dp[0][1] = A[0] # 上のマスのみ黒く塗る
dp[0][2] = B[0] # 下のマスのみ黒く塗る
dp[0][3] = A[0] + B[0] # 上下マス黒く塗る

for i in range(1, N):
    # 塗り方1 塗り方1の隣は、塗り方1か3
    dp[i][1] = min(dp[i - 1][1], dp[i - 1][3]) + A[i]
    # 塗り方2 塗り方2の隣は、塗り方2か3
    dp[i][2] = min(dp[i - 1][2], dp[i - 1][3]) + B[i]
    # 塗り方3 塗り方3の隣は、塗り方1, 2または塗り方3
    dp[i][3] = min(dp[i - 1][1], dp[i - 1][2], dp[i - 1][3]) + A[i] + B[i]

print(min(dp[N - 1][1], dp[N - 1][2], dp[N - 1][3]))