from itertools import combinations
import math

"""
等差数列
偶数の総和
2..109まで
"""

N = int(input())
print((2 + N) * N // 2)


"""
等比数列・・・解けた
初項 * 公比 ** (N-1)

R==1の場合は等比が1の為10^9回る
R==1の場合は等比1なのでAを出力
"""

A, R, N = map(int, input().split())


def geometric(a, r, n):
    func = a
    for _ in range(n):
        if r == 1:
            return A

        func *= r
        if func > 10**9:
            return "large"

    return func


print(geometric(A, R, N - 1))


"""
全104問
[書籍]問題解決のためのアルゴリズム×数学が基礎からしっかりに身につく本のもんdない

計算量の考え方；ざっくりとオーダー記号で表したPCでの計算回数
一般家庭のPCの目安＝10^9回程度（実行時間2秒以内）
"""

"""
問題0_1-100までの総和
単純に N - 1回の計算が発生する
N=100 100-1 =99回

等差数列
隣りあった数の差が同じ
(初項 + N) * 数列の数 / 2

合計101となる50個のペア
101*50=5050


整数：小数点がつかない数：0, -1, 10（分数は除く）
有理数：整数/整数で表すことのできる数・・・0, -1, 1.0, 10、2/3
実数：数直線上で表すことのできる数・・・・π, 0, -1, 1.0, 10、2/3, √3
正の数：0より大きい数
負の数：0未満の数


指数関数：
a^m * a^n = a^m+n
2^5*2^4 = 2^9

a^m/a^n = a^m-n
2^9/2^5 = 2^4

(a^m)^n = a^mn
(2^5)^3 = 2^5*2^5*2^5 = 2^15

a^mb^m = (ab)^m
2^5*3^5 = 6^5
"""
print((1 + 100) * 100 // 2)

"""
3 3
Σ Σ ij
i=1j=1

(1*1)*(1*2)+(1*3)+(2*1)+(2*2)+(2*3)+(3*1)+(3*2)+(3*3)
"""
result = 0
for i in range(1, 4):
    for j in range(1, 4):
        result += i * j
print(result)


"""
10進法から2進法へ変換

例）10の場合→1010
10 % 2 = 0
 10 // 2 = 5
5 % 2 = 1
 5 // 2 = 2
2 % 2 = 0
 2 // 2 = 1
1 % 2 = 1
 1 // 2 = 0・・・ここでループ終了

0101→1010

割った余りを記録
割った商を更新
Nが0になるまで割り続ける
最後に下から順に読む
"""

N = int(input())
ans = ""
while N >= 1:
    if N % 2 == 0:
        ans += "0"
    if N % 2 == 1:
        ans += "1"
    N //= 2
print(ans[::-1])

"""
問題001_Print 5+N（文字式）
"""

print(int(input()) + 5)

"""
問題002_Sum of 3 Integers（足し算）
"""

A, B, C = map(int, input().split())
print(A + B + C)

"""
問題003_Sum of N Integers（足し算）
"""
N = int(input())
print(sum(list(map(int, input().split()))))


"""
問題004_Product of 3 Integers（掛け算）
"""

A, B, C = map(int, input().split())
print(A * B * C)

"""
問題005_Modulo 100（剰余）
"""

N = int(input())
A = list(map(int, input().split()))
print(sum(A) % 100)


"""
問題006_Print 2N+3（１次関数）
時間計算量：O(1)
"""
N = int(input())
print(2 + N + 3)


# 計算時間の見積もり
"""
問題007_Number of Multiples 1（線形時間）・・・考え方の整理
時間計算量の問題
時間計算量：O(N）

→(N+1)/2
"""

N, X, Y = map(int, input().split())
M = [X, Y]
ans, i = 0, 1
for i in range(1, N + 1):
    if i % X == 0 or i % Y == 0:  # 倍数の判定
        ans += 1
print(ans)

"""
問題008_Brute Force 1（全探索）・・・解けた

時間計算量：O(N^2)

1 ≦ N ≦ 1000
N^2通り N*N = 1000*1000 = 1000000 = 10^6回
カードの合計がS以下になる書き方を求める（X）
N=3, S=4の場合
4以下になる組合せは
(1,1)(1,2)(1,3)
(2,1)(2,2)
(3,1)
6通り
"""
ans = 0
N, S = map(int, input().split())
for i in range(1, N + 1):
    for j in range(1, N + 1):
        if i + j <= S:
            ans += 1
print(ans)

"""
問題009_Brute Force 2（組合せの全探索）・・・解けない（土日やる） 

カードの枚数 N枚
2^N（指数関数）に回増えていく

2^N-1回ループ
P66に記載
1.2進法を利用して選び方に番号を振る
2.選び方の番号を全探索

"""

"""
問題010＿Brute Force 2（階乗）
階乗
N=5
5! = 1*2*3*4*5

時間計算量：O(N)
"""
N = int(input())
ans = 1
for i in range(1, N + 1):
    ans *= i
print(ans)


# 再帰処理の場合
def f(n: int):
    if n == 1:
        return 1
    return n * f(n - 1)


"""
問題011_Print Prime Numbers（素数）・・・解けない（土日やる）
N以下の素数を出力する

2..N+1回繰り返す

1と自分自身以外に約数を持たない＝約数（割り切れる数が2個）
"""


N = int(input())
ans = []


def isprime(n: int) -> bool:
    for i in range(2, n):
        if n % i == 0:
            return False
    return True


for i in range(2, N + 1):
    # 素数判定
    if isprime(i):
        ans.append(i)
print(*ans)

"""
問題012_Primality Test・・・理解した

時間計算量：O(√N)

素数判定
1..N-1通りまで調べない

方針：
2..√Nまでの範囲で割り切れなければ素数と判定
2,3,5,7→4,9,25,49
"""

N = int(input())
for i in range(2, int(N**0.5) + 1):
    if N % i == 0:
        print("No")
        exit()
print("Yes")


"""
問題013_Divisor Enumeration（約数列挙）・・・理解できた

計算量を工夫したプログラムにしてください
順序は問わない
時間計算量：O(√N)

方針：
1..√N回繰り返す
Nがiで割れたらiを出力
N//iとiが違うならN//iを出力
"""

N = int(input())
for i in range(1, int(N**0.5) + 1):
    if N % i != 0:
        continue
    print(i)
    n = N // i
    if i != n:
        print(n)

"""
問題014_Factorization（素因数分解）
時間計算量：O(√N lon N)
N**0.5→ルートに変換している
√Nを計算している
0.5＝1/2つまり、ルートを意味する

2..√N回繰り返す
Nを2で割れるだけ割る
Nを3で割れるだけ割る
最後にNが1以外の場合、それを素因数に加える
"""

N = int(input())
ans = []
for i in range(2, int(N**0.5) + 1):
    while N % i == 0:
        N //= i
        ans.append(i)
if N >= 2:
    ans.append(N)
print(*ans)


"""
問題015_Calculate GCD（最大公約数）
ユークリッドの互除法
＊再帰処理

時間計算量：O(log(A+B))

大きい数から小さい数で割った余りを書き換える操作を繰り返す
0になった時点で割った数が最大公約数

注意）
2回目のループ以降x,yの値が入れ替わる
"""

A, B = map(int, input().split())
if A < B:
    A, B = B, A


def gcd(x: int, y: int) -> int:
    if x % y == 0:
        return y
    return gcd(y, x % y)


print(gcd(A, B))

"""
問題016_Greatest Common Divisor of N Integers（最大公約数）・・・解けた
ユークリッドの互除法

2つの最大小約数を計算し次の最大公約数を求めることを繰り返す
前の計算結果と以降の数列の最大小約数を求めることをN-2回繰り返す
"""

N = int(input())
A = list(map(int, input().split()))


def calc_gcd(x: int, y: int) -> int:
    if x % y == 0:
        return y
    return calc_gcd(y, x % y)


x, y = A[0], A[1]
if x < y:
    x, y = y, x
# 1回目の最大公約数を求める
ans = calc_gcd(x, y)

for i in range(N - 2):
    # 最大公約数を求める
    ans = calc_gcd(A[i + 2], ans)
print(ans)


"""
問題017_Least Common Multiple of N Integers（最小公倍数）・・・解けた
1回目の最大公約数を求める
Ai * Ai+1 / 最大公約数 = 最小公倍数
1回目の結果を元に同じ処理をN-2回繰り返す
"""

N = int(input())
A = list(map(int, input().split()))


# 最大公約数を求める
def gcd(x: int, y: int) -> int:
    if x % y == 0:
        return y
    return gcd(y, x % y)


# 最小公倍数を求める
# 1つ目の数 * 2つ目の数 / 最大公約数
def lcm(x: int, y: int, gcd: int) -> int:
    return (x * y) // gcd


x, y = A[0], A[1]
if x < y:
    x, y = y, x
ans = lcm(A[0], A[1], gcd(x, y))

for i in range(N - 2):
    ans = (A[i + 2] * ans) // gcd(A[i + 2], ans)
print(ans)


"""
問題018_Convenience Store 1（場合の数）・・・理解できた
解答の意味がわからない

場合分け
合計が500円になる組み合わせは
100+400 = 500
200+300 = 500 のみ

100,200,300,400をa,b,c,dとしそれぞれのコインの値段の枚数を数える
a*d = b*c
ac+bcが求める答え

コインの枚数をcount関数でカウントしている

500円になる組合せ
100+400=500
200+300=500

100,200,300,400の4種類
a(100),b(200),c(300),d(400)

a*d + b*c = 500

コインの枚数の分布を取る
100*iで枚数に変換

5
100 300 400 400 200

100*1=100
100*2=200
100*3=300
100*4=400

100, 200, 300, 400
1    1    1    2

1*2+1*1=3
"""

N = int(input())
A = list(map(int, input().split()))

a, b, c, d = 0, 0, 0, 0
for i in range(N):
    if A[i] == 100:
        a += 1
    if A[i] == 200:
        b += 1
    if A[i] == 300:
        c += 1
    if A[i] == 400:
        d += 1
print(a * d + b * c)

# 下のコードはO(N^2)でTLE
# coin = [A.count(100*i) for i in range(1, N)]
# print(coin[0]*coin[3]+coin[1]*coin[2])

"""
問題019_Choose Cards 1・・・解けた（場合の数）（要復習）

左から順に同じ色のカードを２枚選ぶ場合の数
x, y, z

各色のカードの枚数のs分布を取る

xC2+yC2+zC2通りの場合の数
＝x(x-1)/2+y(y-1)/2+z(z-1)/2
"""

N = int(input())
A = list(map(int, input().split()))
x, y, z = 0, 0, 0
for i in range(N):
    if A[i] == 1:
        x += 1
    if A[i] == 2:
        y += 1
    if A[i] == 3:
        z += 1

x = x * (x - 1) // 2
y = y * (y - 1) // 2
z = z * (z - 1) // 2
print(x + y + z)


"""
問題020_Choose Cards 2（全探索）・・・（土日やる）
nC5の組み合わせ ５枚選ぶ
＊異なるn個のものの中からr個選ぶ

時間計算量：O(N^4)
4枚のカードの番号が決まれば残りのカードの番号も分かる
4重ループで実装できる。

Ai+1+Ai+2+Ai+3*Ai+4+Ai+5 = x
Ai+5 = x-Ai+1-Ai+2-Ai+3-Ai+4 
1000 - Ai+1 - Ai+2 - Ai+3+Ai+4 = Ai+5

x = 1000 - (i+j+k+l)

だたし
・同じカードを2回使ってはいけない
・同じ組み合わせの重複のカウントを防ぐ    i < j < k < l < m
"""
N = int(input())
A = list(map(int, input().split()))

# from itertools import combinationで5枚の組合せを全て取り出す場合
# ans = 0
# for cards in combinations(A, 5):
#   if sum(cards) == 1000:
#     ans += 1
# print(ans)

N = int(input())
A = list(map(int, input().split()))
A_set = set(A)
ans = 0
for i in range(N):
    for j in range(i + 1, N):
        for k in range(j + 1, N):
            for l in range(k + 1, N):
                x = 1000 - (A[i] + A[j] + A[k] + A[l])
                for m in range(l + 1, N):
                    if A[m] == x:
                        ans += 1
print(ans)


"""
問題021_Combination Easy（nCr）・・・解けない（理解できた）(土日復習)
nCr = N!/(r!*(n-r)!)

例）N=6 r=2
6!/2!*(6-2)!
=6!/2!*4!
=720/48
=15

N!を求める

r!を求める

N-r!を求める

上記の公式で計算
n!/r*(n-r)!

nPr = r!*nCr

nCr・・・順番を区別しない
nPr・・・順番を区別する
"""

n, r = map(int, input().split())
# 階乗の計算
# nCr = n!/r!*(n-r)!
# N!を求める
fact_n = 1
for i in range(1, n + 1):
    fact_n *= i

# r!を求める
fact_r = 1
for i in range(1, r + 1):
    fact_r *= i

# n-r!を求める
fact_nr = 1
for i in range(1, n - r + 1):
    fact_nr *= i

combination = int(fact_n / (fact_r * fact_nr))  # nCr
print(combination)
print(fact_r * combination)  # nPr

"""
問題022_Choose Cards 3・・・解けない（要復習）

出目の和期待値＝（青の出目の期待値）＋（赤の出目の期待値）
青の出目の期待値＝（B1+B2+Bn）/ N
赤の出目の期待値＝（R1+R2+Rn）/ N

（B1+B2+Bn）/ N ＋（R1+R2+Rn）/ N
"""

"""
問題023_Dice Expectation・・・（期待値）・・・解けた
＊和の期待値は和となる性質

2つの試行を行う

1番目の試行をX、2番目の試行をYとする
Xの期待値をE[X], Yの期待値をE[Y]とするとき、
X＋Yの期待値 = E[X]+E[Y]

2つの出目の和の期待値＝ (X1+X2+X3..Xn / N) + (Y1+Y2+Y3...Yn) / N

:.12f・・・小数点第12位まで出力するフォーマット指定子
"""


N = int(input())
B = list(map(int, input().split()))
R = list(map(int, input().split()))
print("{:.12f}".format(sum(B) / N + sum(R) / N))

"""
問題024_Answer Exam Randomly・・・（期待値）・・解けた

合計点数の期待値＝(1問目の点数の期待値) + (2問目の点数の期待値)+...(N問目の点数の期待値)

合計点数の期待値＝Q1/P1 + Q2/P2...+Qn/Pn
"""

N = int(input())
ans = 0.0
for i in range(N):
    P, Q = map(int, input().split())
    ans += Q / P
print("{:.12f}".format(ans))

"""
問題025_Jiro's Vacation（期待値）・・・解けない

サイコロの確率 1/6

1,2の場合：
1回目が1の目が出る確率・・・1/6
2回目が2の目が出る確率・・・1/6
＊1/6 + 1/6 = 2/6 = 1/3

それ以外の場合（3,4,5,6）
＊4/6 = 2/3
"""

N = int(input())
A = list(map(int, input().split()))
B = list(map(int, input().split()))
ans = 0.0
for i in range(N):
    ans += A[i] * (1.0 / 3.0) + B[i] * (2.0 / 3.0)
print("{:.12f}".format(ans))

"""
問題026_Coin Gacha・・・解けない （保留）
"""


"""
動的計画法028_Frog 1・・・解けない（動的計画法）

時間計算量：O(V＋E）
V＝ノード数 E = エッジ数

動的計画法とは＝計算の重複を避けるアルゴリズム（無駄をなくす）

動的計画法のイメージ（以下の３つの特徴を持ったアルゴリズム）
・問題をいくつかの小さな問題に分割
・それぞれの問題の計算結果を表に記録
・同じ問題に対して表から計算結果を参照する

大きな問題を小さな問題に分割し最終的な解を求める
→分割統治法

＊計算の重複を避ける（メモ化）

漸化式
𝐹⁡(𝑛)=𝐹⁡(𝑛−1)+𝐹⁡(𝑛−2)𝐹⁡(0)=0,𝐹⁡(1)=1

4
10 30 40 20


フィナボッチ数列：
f(n) = f(n - 1) + f(n - 2)
a1,a2,a3..an
a1+a2 = a3
i,i+1,i+2...i+N
i+i+1 = 2i+1
"""

"""
||：絶対値
[何かしら整数]：切り捨て

足場１から足場へ移動するコスト＝０
足場１かあ足場iへ移動するコスト＝|i - i+1|
足場１から足場２へ移動するコスト＝|i - i+2|

足場i=1..7まである

N = 7
A = 2,9,4,5,1.6.10

開始
[0, None,None,None,None,None,None]

i = 1
dp[0] + |2-9| = 7
[0, 7,None,None,None,None,None]

i = 2..7まで繰り返す
ノード2から来る方法
dp[i - 1] + |9-4| = 12

ノード1から一つ飛ばして来る方法
dp[i - 2] + |2-4| = 2

最小値の比較（min）
最小値は2だから、2をdpに記録
[0, 7, 2,None,None,None,None]

i = 3
ノード3から来る方法
dp[i - 1] + |4-5| = 3

ノード2から一つ飛ばして来る方法
dp[i - 2] + |9-5| = 11

最小値の3を記録
[0, 7, 2, 3,None,None,None]

i = 4
ノード4から来る方法
dp[i - 1] + |5-1| = 7

ノード3から一つ飛ばして来る方法
d@[i - 2] + |4-1| = 5

最小値の3を記録
A = 2,9,4,5,1.6.10
[0, 7, 2, 3, 5,None,None]

i = 5
ノード5から来る方法
dp[i - 1] + |1-6| = 10

ノード4から一つ飛ばして来る方法
d@[i - 2] + |5-6| = 4

最小値の4を記録
[0, 7, 2, 3, 5, 4,None]

i - 6
ノード6から来る方法
dp[i - 1] + |6-10| = 8

ノード5から来る方法
dp[i - 2] + |1-10| = 14

最小値の8を記録
[0, 7, 2, 3, 5, 4, 8]

最小回数＝８
"""

# 他の人の解法
N = int(input())
A = list(map(int, input().split()))
dp = [0] * N
# 動的計画法
for i in range(1, N):
    if i == 1:
        dp[i] = dp[i - 1] + abs(A[i - 1] - A[i])
        continue
    dp[i] = min(dp[i - 1] + abs(A[i - 1] - A[i]), dp[i - 2] + abs(A[i - 2] - A[i]))
print(dp[N - 1])


"""
問題029_Climb Stairs・・・解けた（動的計画法）

dp[n] = dp[n - 1] + dp[n - 2]
→フィナボッチ数列
"""

N = int(input())
dp = [0] * (N + 1)
dp[0], dp[1] = 1, 1
for i in range(2, N + 1):
    dp[i] = dp[i - 1] + dp[i - 2]
print(dp[N])


"""
問題031_Taro's Vacation・・・動的計画法・・・解けない（要復習）
計算量の工夫の問題
"""
# これはダメ
N = int(input())
A = list(map(int, input().split()))
m = 0
for i in range(N - 2):
    if m < A[i] + A[i + 2]:
        m = A[i] + A[i + 2]
print(m)

"""
問題032_Binary Search（二分探索）・・・解けた
時間計算量：O(log N）

あらかじめ昇順または降順のデータに対して使うアルゴリズム
"""

N, X = map(int, input().split())
A = list(map(int, input().split()))
A.sort()
left, right = 0, len(A) - 1
ans = "No"
while left <= right:
    mid = (left + right) // 2
    if X == A[mid]:
        ans = "Yes"
        break
    if A[mid] < X:
        left = mid + 1
    else:
        right = mid - 1
print(ans)


"""
問038_How Many Guests? ・・・解けない・・・階差と累積和（要復習）
時間計算量：O(N±Q）

階差：Bi = Ai-Ai- 1
累積和：Bi = A1+A2+...Ai
累積和ー階差
"""

# TLE（実行制限時間エラー）
# 計算回数が重複しているから改善できる
N, Q = map(int, input().split())
A = list(map(int, input().split()))
for i in range(Q):
    L, R = map(int, input().split())
    print(sum(A[L - 1 : R]))


"""
約数のカウント
"""

N, K = map(int, input().split())
ans = []

for i in range(N, 0, -1):
    count = 0
    for j in range(1, N + 1):
        if i % j == 0:
            count += 1
    if count == K:
        ans.append(i)

print(len(ans))


"""
素数の個数
"""

N = int(input())
A = list(map(int, input().split()))
p = []
for n in A:
    count = 0
    for j in range(1, n):
        if n % j == 0:
            count += 1
    if count == 1:
        p.append(n)
print(len(p))


"""
最大公約数（再帰処理）

ユークリッドの互除法
A％B==0になるまでクリア返し0になったらBを返却
"""

A, B = map(int, input().split())
if A < B:
    A, B = B, A


def gcd(A, B):
    if A % B == 0:
        return B
    return gcd(B, A % B)


print(gcd(A, B))

"""
2でも3でも5でも割り切れない数
"""

N = int(input())
ans = 0
for i in range(1, N + 1):
    if i % 2 == 0:
        continue
    if i % 3 == 0:
        continue
    if i % 5 == 0:
        continue
    ans += 1
print(ans)


"""
2025/3/13
最大公約数を求める
ユークリッドの互除法
わられる数 = わる数 × 商 + 余り
・ゼロになるまで余りを取っていく
・最後に割った数が最大公約数

再帰処理 y(割った数と余りが変化していくのが肝)
"""


def god(x, y):
    # 最大公約数を返す
    if x % y == 0:
        return y
    # 余りがゼロになるまで繰り返す
    return god(y, x % y)


x, y = 2431, 1496
print(f"{x},{y}の最大公約数＝{god(x, y)}")


"""
ARC問題046_ゾロ目数
ゾロ目とは
すべての桁の数字が同じ数をゾロ目とする
1,2,3,4,5,6,7,8,9
11,22,33,44,55,66,77,88,99

桁が増えても９通り
N%9で割った数の余りを求める
"""


# 数学の解法
N = int(input())

x = math.ceil(N / 9)
y = N % 9
if y == 0:
    y = 9
print(str(y) * x)

K = int(input())
A, B = map(int, input().split())

# 数学的解法
x = A // K
y = B // K

ok = False
# Kの倍数がA、Bの範囲の中にある
if x < y:
    ok = True

if A % K == 0:
    ok = True

if ok:
    print("OK")
else:
    print("NG")


"""
D問題_tcaF・・・解けた
"""

X = int(input())
func = 1
ans = 0
for x in range(1, X + 1):
    func *= x
    if func == X:
        ans = x
        break
print(ans)


"""
【最大公約数・・・・ユークリッドの互除法】

長方形→正方形にする
＝全ての辺の長さを等しくする＝最大公約数（割り切れる数にする）

最大公約数を求める

x＝gcd(A, B)

立方体を作る＝すべての辺の長さが同じになるように切る

全てのピースを立方体にできるか？
正方形を作ることができるか？

立方体＝全ての辺の長さが等しい正方形
切って分ける＝同じサイズの立方体を作る
各辺の長さを同じにするには、辺の長さの最大公約数で割るしかない


フェーズ	人間的な理解	数学的変換
1	「立方体を作る」	「3辺を等しくしたい」
2	「切る」	「整数倍に分割」
3	「ぴったり分割したい」	「公約数を考える」
4	「できるだけ大きな立方体にしたい」	「最大公約数（GCD）」

正方形を作る条件
・幅Aがxで割り切れる
・幅Bがxで割り切れる
・幅Cがxで割り切れる

a,b,cの最大公約数＝gcd(A, gcd(B, C))

切る回数＝(a // x - 1) + (b // x - 1) + (c // x - 1)

なぜなら「長さを等しくする」＝「割り切れる長さ」＝「最大公約数」
x ,  y
(30, 24 % 30) = 24
(24, 30 % 24) = 6
(6, 24 % 6)

(2, 3)

(3, 2 % 3) = 2
(2, 3 % 2) = 1
(1, 2 % 1) = 0

最大公約数＝１

"""

A, B, C = map(int, input().split())


def gcd(x, y):
    if y == 0:
        return x
    return gcd(y, x % y)


x = gcd(A, gcd(B, C))
print((A // x - 1) + (B // x - 1) + (C // x - 1))


"""
問題C_429_Odd One Subsequence・・・解けない
難易度201
"""

from collections import Counter

N = int(input())
A = list(map(int, input().split()))
counter = Counter(A)

ans = 0
for count in counter.values():
    # v個の中から同じ値を2個選ぶ組合せ数 * 異なる値を1個選ぶ選択肢の数
    # 値vを2つ選ぶ * 値v以外を1つ選ぶ
    ans += count * (count - 1) // 2 * (N - count)

print(ans)


"""
問題081_Bill Changing Problem・・・解けた
貪欲法

N円の内、10,000円が使える枚数を求める
N // 10000 = 使える枚数
N % 10000 = 残り残金

以上の処理を5,000円、1000円でも繰り返し枚数を足していく
"""

N = int(input())
ans = 0
money = [10000, 5000, 1000]
for i in range(3):
    ans += N // money[i]
    N %= money[i]
print(ans)

"""
問題059_Power Of two・・・ほぼ解けた
規則性を見つける

2^Nの一の位を求める
2進数で考えた時に、Nの指数に割り当てていくと
2 - 4 - 8 - 6と周期性がある為、
一の位は2,4,8,6の4パターンのいずれかしかない。

"""

N = int(input())
if N % 4 == 1:
    print(2)
if N % 4 == 2:
    print(4)
if N % 4 == 3:
    print(8)
if N % 4 == 0:
    print(6)


"""
問題064_All Zero
頭使う（偶奇に着目）
"""

N, K = map(int, input().split())
A = list(map(int, input().split()))
total = sum(A)
if total % 2 != K % 2:
    print("No")
elif total > K:
    print("No")
else:
    print("Yes")


"""
等差数列
貯金額の推移を出力

500*X+100
"""

N, X = map(int, input().split())
for i in range(N + 1):
    print(500 * i + X)


"""
B問題_Geometric Sequence・・・解けた（等比数列）
難易度147

等比数列とは、A2／A1の項を割った比が等しい数列

A1 A2 A3 A4 A5
A2/A1 = A3/A2 日は等しい
→浮動小数を整数に直すと
★A1*A3 = A2^2になる
"""

N = int(input())
A = list(map(int, input().split()))
for i in range(N - 2):
    if A[i] * A[i + 2] != A[i + 1] ** 2:
        print("No")
        exit()
print("Yes")

"""
A問題_Isosceles
二等辺三角形かどうか
"""

a, b, c = map(int, input().split())
if a == b or a == c or b == c:
    print("Yes")
else:
    print("No")


"""
A問題_What month is it?
月の計算
"""

X, Y = map(int, input().split())
ans = (X + Y) % 12
if ans != 0:
    print(ans)
else:
    print(12)


"""
A問題_WrongAnswer
難易度13

A,B以外の値を0, 1で固定する
0 = 1
1 = 0に反転
難し考えすぎては解けない
"""

A, B = map(int, input().split())
print((A + B) ^ 1)


"""
A問題_EgeChecker・・・解けた
少し頭使う
難易度11
"""

a, b = map(int, input().split())
if b - a == 1 or b - a == 9:
    print("Yes")
else:
    print("No")


"""
A問題_Cabbages・・・解けた
難易度19

少し頭使う
キャベツをN個以上買える場合と買えない場合で分ける
"""

N, A, X, Y = map(int, input().split())
if A < N:
    print((X * A) + (Y * (N - A)))
else:
    print(N * X)

"""
A問題_Counting
A以上B以下の個数
"""

A, B = map(int, input().split())
print(max(0, B - A + 1))


"""
A問題_Rock-paper-scissors・・・解けた
少し頭使う

あいこになる場合分け
"""

x, y = map(int, input().split())
if x == y:
    print(x)
else:
    print(3 - (x + y))


"""
A問題_Chinchirorin・・・解けた
難易度6

場合分け
a = b → c
a = c → b
b = c → a
a = b = c → a
a ≠ b ≠ c → 0
"""

a, b, c = map(int, input().split())
if a == b:
    print(c)
elif a == c:
    print(b)
elif b == c:
    print(a)
elif a == b == c:
    print(a)
else:
    print(0)

"""
A問題_Div・・・解けた
難易度10

A,Bがお菓子を分けた時に両方が1個以上になるお菓子を得る分け方は
何通りあるか
"""
N = int(input())
if N < 2:
    print(0)
else:
    print(N - 1)


"""
A問題_Star
"""

X = int(input())
n = X + 100 - (X % 100)
print(n - X)


"""
A問題_Transfer

容器2のCmlを容器1へ移せるだけ移す
"""

A, B, C = map(int, input().split())
print(max(0, C - (A - B)))

"""
A問題_WhiteCells・・・解けた
難易度18

少し頭使う
H行W列の白いマス目の中からh行個、w列個選び黒く塗る。
白いマス目が残った個数は？
"""

H, W = map(int, input().split())
h, w = map(int, input().split())
print(max(0, (H - h) * (W - w)))


"""
A問題_ABC333
奇数になるCは存在するか？

A*Bが偶数の時点で奇数にはならない
"""

A, B = map(int, input().split())
print("Yes" if A * B % 2 != 0 else "No")

"""
A問題_AtCoder Crackers・・・解けた
難易度30

N枚のクッキーをなるべく均等に配る
NがK人でわり歴＝0
NがKで割り切れない＝1
均等に配る場合に全体的に+1配る為, 差が2以上になることはない
"""

N, K = map(int, input().split())
if N % K == 0:
    print(0)
else:
    print(1)

"""
A問題_Infinite Coins・・・解けた
難易度39

500円のみ＝N
500円＋1円の組合せ＝N
それ以外
"""

N = int(input())
A = int(input())
ans = 500 * (N // 500)
if ans == N:
    print("Yes")
elif (N - ans) < A:
    print("Yes")
else:
    print("No")

"""
A問題_HEX
アルファベットの比較
"""

A, B = input().split()
if A < B:
    print("<")
elif A == B:
    print("=")
else:
    print(">")

"""
A問題_RatingGoal・・・式変形あり
難易度48

x = 次回コンテストのパフォーマンス

(R + x)//2 = G
両辺に2をかける

R + x = 2G
Rを移行し、
x = 2G - R
"""

R = int(input())
G = int(input())
print(2 * G - R)


"""
A問題_ringring
難易度53
"""

a, b, c = map(int, input().split())
ans = 10**5 + 1
ans = min(ans, a + b, a + c, b + c)
print(ans)


"""
A問題_HonestOrDishonest・・・解けた
難易度53

AtCorDeerくんが真実を言っているか嘘をついているかを判定
"""

a, b = input().split()
if a == "H":
    print(b)
elif a == "D" and b == "H":
    print("D")
else:
    print("H")


"""
A問題_キャンディーと2人の子供
少し頭使う
"""

A = sorted(map(int, input().split()))
a, b = A[0] + A[1], A[2]
print("Yes" if a == b else "No")


"""
A問題_高橋君とホテルイージー・・・解けた
難易度30

宿泊費の計算

K日までX円
K＋1日目以降はNーK＊Y円
但し、N <= Kの場合はK日宿泊できない為、N日のみ計算とする
max(0, N - K)とし、N < Kで負の場合も、0制御している
"""

N = int(input())
K = int(input())
X = int(input())
Y = int(input())
print(X * min(N, K) + max(0, N - K) * Y)


"""
B問題_鉄道旅行 3 (Railway Trip 3)・・・少し難しい
頭使う
"""

P, Q = map(int, input().split())
A, B = map(int, input().split())
print(A * min(Q, P) + max(0, Q - P) * B)


"""
B問題_火曜日・・・解けた
難易度50

火曜日の法則
日曜日＋２＝火曜日
X日後 % 7をするとあまりが必ず２日余るのが火曜日

X日後の曜日の計算
X％７＝基準日からの曜日の日数

月：１
火：２
水：３
木：４
金：５
土：６
日：７
"""

X = int(input())
print(1 if X % 7 == 2 else 0)


"""
第16回情報オリンピック予選_電子レンジ
"""

A = int(input())
B = int(input())
C = int(input())
D = int(input())
E = int(input())

ans = 0
if A < 0:
    ans += C * abs(A)
    ans += D
    ans += E * B
else:
    ans = (B - A) * E
print(ans)


"""
問題_高橋直体
直方体の表面積

2 * (ab + bc + ca)
"""

A, B, C = map(int, input().split())
print(2 * (A * B + B * C + C * A))


"""
A問題_饅頭

C円でできるだけ多く買う
"""

A, B, C = map(int, input().split())
print(max(0, C // A, C // B))


"""
問題A_TV画面のアスペクト比
"""

W, H = map(int, input().split())
if 4 * H == 3 * W:
    print("4:3")
else:
    print("16:9")


"""
B問題_ペア

偶奇に着目
偶数：n - 1
奇数：n + 1
n番目の人の番号
"""

n = int(input())
if n % 2 == 0:
    print(n - 1)
else:
    print(n + 1)


"""
B問題_入浴時間
秒数を時、分、秒へ変換

制約
0 ≦ N ≦ 86399

1日を越えることはない
1日（秒数）＝60 * 60 * 24 = 86400秒
1時間（秒数）＝3600秒

3600の秒数で割った商が時間、余りが分
余りを更に分単位に変換
"""

N = int(input())
h = N // 3600
m = (N % 3600) // 60
s = (N % 3600) % 60
print("{:02d}:{:02d}:{:02d}".format(h, m, s))

"""
A問題_来月は何月？
"""

N = int(input())
print(N % 12 + 1)


"""
問題A_Payment・・・解けた
難易度12

お釣りの金額を求める
その為には1000円札の使う枚数を求めたい

１０００円札で支払うのは下３桁のみがお釣りに影響する
下３桁のみのを取り出す

切り上げ処理

1000円札を使う枚数を求めたい
N円の1000と100の桁を100で割り取り出し、+10し桁繰り上げる（0-10の周期の考え方 10新数）
"""

# ベストプラクティス
N = int(input())
print((1000 - N % 1000) % 1000)

# ダメなコード
if N % 1000 == 0:
    print(0)
else:
    z = ((N // 100) + 10) // 10
    print(max(1000 - N, 1000 * z - N))


"""
A問題_Takoyaki・・・解けない
難易度19

たこ焼きの焼く回数

times = （N＋X−１）// X？？


切り捨て除算：N//X
切り上げ除算：（N＋X−１）// X
→NをXで割った切り上げ回数

合計時間＝回数＊T 
"""

N, X, T = map(int, input().split())
times = (N + X - 1) // X
print(times * T)

"""
鉛筆 (Pencils)・・・解けた
"""

N, A, B, C, D = map(int, input().split())


def kosu(x, N):
    return (N // x) if N % x == 0 else N // x + 1


print(min(kosu(A, N) * B, kosu(C, N) * D))


"""
宿題
切り上げ処理
全部でAあるものをCずつ削っていたっ時に何回で削り切れるか？

余りの切り上げ処理：(a + b - 1) // b
"""


L = int(input())
A = int(input())
B = int(input())
C = int(input())
D = int(input())


koku = (A + C - 1) // C
sansu = (B + D - 1) // D

print(L - max(koku, sansu))


"""
問題A_430_CnadyCookieLaw
難易度18
"""

A, B, C, D = map(int, input().split())
if C >= A and D < B:
    print("Yes")
else:
    print("No")


"""
B問題_Distance Between Tokens・・・解けた
難易度57

２点間の距離を求める
|x2 - x1| + |y2 - y1| = 2点間の距離
距離を計算する為に座標が必要
H＊W回走査し、S[i][j]が”o”の座標を予め調べておく
"""

H, W = map(int, input().split())
S = [input() for _ in range(H)]

dist = []
for i in range(H):
    for j in range(W):
        if S[i][j] == "o":
            dist.append((i, j))

x1, y1 = dist[0]
x2, y2 = dist[1]
print(abs(x2 - x1) + abs(y2 - y1))

"""
A問題_366_Election 2 ・・・解けた
難易度20

現時点で勝敗が確定しているか？
有効票＝N
確定している＝過半数の票を片方が持っている状態

過半数＝N//2±1
"""

N, T, A = map(int, input().split())
maj = N // 2 + 1
if T >= maj or A >= maj:
    print("Yes")
else:
    print("No")


"""
問題A_A Healthy Breakfast・・・解けた
難易度19
"""

S = input()
if S[0] == "M" or S[2] == "R":
    print("No")
else:
    print("Yes")

"""
問題A_Who Ate the Cake?
1,2,3 = 6

"""

A, B = map(int, input().split())
if A == B:
    print(-1)
else:
    print(6 - (A + B))


"""
A問題_tommorow・・・解けない
難易度25


年月日の場合分けの整理

入力上の制約は超えないことが保障されるが、
プログラムの過程で制約を超える

予め日を＋１
1ヶ月経っている場合：日を1にリセット、月＋１
1年経っている場合：年＋１、月、日を１にリセット
"""

M, D = map(int, input().split())
y, m, d = map(int, input().split())

d += 1  # 日を1日進める
if D < d:  # 日を跨いでいる場合は月を進め日を1日から開始
    m += 1
    d = 1
if m > M:  # 年を越しているなら年に1年進め月と日を1日から開始
    y += 1
    m = 1
print(y, m, d)


"""
A問題_FullMoon・・・解けない
難易度14

1日目からN日目までの間に見れらる満月の個数を求める
＝1以上N個以下の整数のうち、Pの倍数 N / P個（商）

M日目を0日目にする為に、N - MしMを0日目に開始に変更
M, M+P, M+2P → 0, P, 2P

N - M//Pが N - M/P個が求められる。
ただしMも含むため、＋１
N＜Mの場合は、満月は見られない為、0

よって, max(0, (N - M)//P + 1)
"""

N, M, P = map(int, input().split())
print(max(0, (N - M) // P + 1))

# 愚直解
N, M, P = map(int, input().split())
ans = 0

while M <= N:
    ans += 1
    M += P
print(ans)


"""
問題A_309_Nine・・・解けた
難易度22

A%3!=0かつA+1=B
"""
A, B = map(int, input().split())
if A % 3 != 0 and A + 1 == B:
    print("Yes")
else:
    print("No")


# ダメな解法
if B == 4 or B == 7:
    print("No")
elif B - A == 1:
    print("Yes")
else:
    print("No")


"""
A問題_WaterStation・・・ギリ解けた
難易度10
"""

N = int(input())
num = (N // 10) * 10
l = N - num
r = (num + 5) - N
if l < r:
    print(num)
else:
    print(num + 5)

print(round(N / 5) * 5)


"""
EdgeChecker2・・・解けた
難易度11
木構造の問題

aとbが線で結ばれているか？

b // 2 = a
"""

a, b = map(int, input().split())
print("Yes" if b // 2 == a else "No")

"""
A問題_Batting Average・・・解けた
難易度23

小数点第3位まで表示
"""

A, B = map(int, input().split())
print("{:.3f}".format(B / A))


"""
A問題_Apple（貪欲法）Greedy
難易度18

りんごをちょうどN個買うのに最低何円必要か？

場合分け
X単品で買うのがお得か
Y＋Xのセットで買うのがお得かを比較し、
最小の金額を求める
"""

X, Y, N = map(int, input().split())
print(min(X * N, Y * (N // 3) + X * (N % 3)))


"""
A問題_A Unique Letter・・・解けた
難易度12
"""

S = sorted(input())
a, b, c = S
if a == b == c:
    print(-1)
elif a == b:
    print(c)
elif b == c:
    print(a)
else:
    print(a)


"""
A問題_245_GoodMorning・・・解けた
難易度25

時間を分に変換して解く
60新数を10進数に変換し、構造を単純化
"""

A, B, C, D = map(int, input().split())
if C * 60 + D < A * 60 + B:
    print("Aoki")
else:
    print("Takahashi")


"""
A問題_Rotate・・・解けた
難易度６
"""

a, b, c = map(int, input())
x = 100 * a + 10 * b + c
y = 100 * b + 10 * c + a
z = 100 * c + 10 * a + b
print(x + y + z)

"""
A問題_FirstGrid・・・解けた
難易度24

連結性の判定＝斜めが隣接していない

斜めのパターンは2通りのみ。
黒マスは最低でも2マス含まれることが保証されている。

"""

S1, S2 = input(), input()
if S1[0] == "." and S2[1] == ".":
    print("No")
elif S1[1] == "." and S2[0] == ".":
    print("No")
else:
    print("Yes")


"""
A問題_RollingDice・・・解けた
難易度28

1-6の出目のサイコロをA回降理、合計をBにできるか？

最小値と最大値を考える
最小値：A(1)
最大値：6A
以上の範囲内であればBにできる
"""

A, B = map(int, input().split())
if A <= B <= 6 * A:
    print("Yes")
else:
    print("No")

# 自分の解法（冗長）
if B // A + B % A <= 6:
    print("Yes")
else:
    print("No")


"""
A問題_TinyArithmeticSequence・・・解けた
難易度12

並べ替えて等差数列にできるか？
"""

A = sorted(map(int, input().split()))
print("Yes" if A[1] - A[0] == A[2] - A[1] else "No")

"""
A問題_Diffrence Max・・・解けた
最大 - 最小
"""

a, b = map(int, input().split())
c, d = map(int, input().split())
print(b - c)

"""
A問題_191_Vanishing Pitch・・・解けない
難易度25

VT <= D <= VSの場合は打てない
V＝速さ T＝時間
ボールが消えている距離は
V*T, V*Sの間
"""

V, T, S, D = map(int, input().split())
T *= V
S *= V
if T <= D <= S:
    print("No")
else:
    print("Yes")


"""
A問題_190_Very Very Primitive Game・・・解けた
難易度14

場合分け
A=B and C == 0：Aoki
A=B and  C == 1:Takahashi
A<B: Aoki
A>B: Takahashi
"""

A, B, C = map(int, input().split())
if A == B and C == 0:
    print("Aoki")
elif A == B and C == 1:
    print("Takahashi")
elif A < B:
    print("Aoki")
else:
    print("Takahashi")

# 公式解法
A, B, C = map(int, input().split())
if A > B - C:
    print("Takahashi")
else:
    print("Aoki")


"""
B問題_191_Variousdistance・・・ギリ解けた
難易度129

ループ構造のバグに気をつける
N-1回ずつ処理
2つを足すのではなく、１つだけ加算していけばいい。
問題文をちゃんと読む
"""

N = int(input())
X = list(map(int, input().split()))

m = 0
u = 0
c = 0
for x in X:
    ax = abs(x)
    m += ax
    u += ax**2
    c = max(c, ax)

print(m, "{:.15f}".format(u**0.5), c, sep="\n")


"""
A問題_175_Rainy Season・・・解けた
難易度23

場合分けの問題
"""

a, b, c = input()

ans = 0
if a == b == c == "R":
    ans += 3
elif a == b == "R" or b == c == "R":
    ans += 2
elif a != b:
    ans += 1
elif b != c:
    ans += 1
print(ans)


"""
B問題_174_Distance・・・解けた
難易度43

N=1のケースなし？
"""

N, D = map(int, input().split())
ans = 0

for i in range(N):
    x, y = map(int, input().split())
    if (x**2 + y**2) ** 0.5 <= D:
        ans += 1
print(ans)


"""
B問題_170_Crane and Turtle・・・解けた
難易度52

鶴亀算
亀の数a, 鶴をの数bと置く
連立方程式を立てる

a + b = X
4a + 2b = Y

・足の数Yが2X〜4Xの範囲
・Y - 2Xが偶数
・負の解を除外する
"""

X, Y = map(int, input().split())

a = (Y - 2 * X) // 2
b = X - a
if abs(a) + abs(b) != X:
    print("No")
elif 4 * a + 2 * b != Y:
    print("No")
else:
    print("Yes")


"""
B問題_176_Battle・・・解けない
切り上げ処理（a+b-1)//b

(A + D - 1)//D
→体力Aのキャラが、攻撃力Dの攻撃に何回耐えられるか？（何手で倒れるか？）
相手を倒すまでに必要な攻撃回数を比較する

A//Dではダメ
＝これは体力Aの中にD回分完全に入るという意味
敵を倒し切る端数（ラスト１回の攻撃が必要）


高橋の勝利条件：
高橋の方が攻撃回数が少ないまたは攻撃回数が青木と同じ
"""

A, B, C, D = map(int, input().split())
taka = (A + D - 1) // D
aoki = (C + B - 1) // B
print("No" if taka < aoki else "Yes")


"""
B問題_160_GoldenCoins・・・解けた
難易度19

コインを両替した時の嬉しさの最大値

できる限り500円硬貨を手に入れたあと、端数で5円硬貨を手に入れるのが最善

X//500=500円硬貨の枚数
X%500=端数
(X%500)//5=5円硬貨の枚数
"""

# ベストプラクティス
X = int(input())
a = X // 500
b = (X % 500) // 5
print(a * 1000 + b * 5)

# 冗長
a = X // 500
print(1000 * a + max(((X % 500) // 5) * 5, ((X % 500) // 1000) * 1000))


"""
B問題_138_Resistors in Parallel・・・ギリ解けた
難易度59

最小公倍数の問題

注）最小公倍数は逐次更新する！！！！
分母を揃える＝最小公倍数
＝最小公倍数を求める為に最大公約数を求める

分子を計算＝最小公倍数 // Aiの総和

lcm / 分子＝逆数の総和の逆数
"""


N = int(input())
A = list(map(int, input().split()))
lcm_ = A[0]
# 最小公倍数を逐次更新
for i in range(1, N):
    lcm_ = lcm_ * A[i] // math.gcd(lcm_, A[i])

k = 0
for a in A:
    k += lcm_ // a

print(lcm_ / k)


# 別解（一番シンプル）
N = int(input())
A = list(map(int, input().split()))
total = 0
print(1 / sum(1 / a for a in A))

"""
B問題_137_One Clue・・・解けた
難易度36

連続するK個の範囲を求める
X - K + 1...(X + K - 1)+1
"""

K, X = map(int, input().split())
print(*list(range(X - K + 1, (X + K - 1) + 1)))


"""
A問題_135_Harmony・・・解けた
難易度33

|A - k| == |B - k|になるkは存在するか？

距離が等しい点は中点＝A+B//2

式変形後
|A - k| = -(B - K)
A - k = -B + K
それぞれ移行し、

A + B = 2k
2k = A + B
両辺を2で割り、k = (A + B)//2で求められる
"""


A, B = map(int, input().split())
k = (A + B) // 2
print(k if abs(A - k) == abs(B - k) else "IMPOSSIBLE")

"""
C問題_OneTimeSwap・・・解けない
難易度479

組合せ＋数え上げ問題
nC2個取り出す
"""

from collections import Counter

S = input()
N = len(S)

count = Counter(S)

same = 0
# 組合せ(nC2の数え上げ問題:異なるn個の中から2個選ぶ)
comb_all = N * (N - 1) // 2
# スワップした結果
# Sが同じ文字か違う文字かで場合分け
for c in count.values():
    same += c * (c - 1) // 2
# 違う文字の個数＝nC2 - 同じ文字で求められる
diff = comb_all - same
# same > 0より大き場合は同じ文字が含まれているパターンの時のみ
# 例）aabbc, abccd, aaaaaa
ans = diff + 1 if same > 0 else 0
print(ans)


"""
B問題_136_GoldenApple・・・解けない
難易度47

区間の長さ
R - L + 1
+1することで両端を含む

例）3-7の個数を求めるようなケース

距離
R - L

切り上げ処理
(A + B - 1) // B
"""

N, D = map(int, input().split())
w = 2 * D + 1
print((N + w - 1) // w)


"""
問題B_119_DigitalGifts・・・解けた
難易度79
"""

N = int(input())
BIT = 380000.0
ans = 0
for _ in range(N):
    x, u = input().split()
    ans += int(x) if u == "JPY" else BIT * float(x)
print(ans)

"""
問題B_111_AtCorderABC111・・・解けた
難易度58

111回ごとにループする
"""


N = int(input())
# 111-999までのループを回しNを超えた時点のゾロ目を出力
# +111ずつしていきゾロ目を作る
for n in range(111, 1000, 111):
    if N > n:
        continue
    print(n)
    exit()

# 冗長な解法
N = int(input())
if N <= 222:
    if N <= 111:
        print(111)
    else:
        print(222)
elif N <= 444:
    if N <= 333:
        print(333)
    else:
        print(444)
elif N <= 666:
    if N <= 555:
        print(555)
    else:
        print(666)
elif N <= 888:
    if N <= 777:
        print(777)
    else:
        print(888)
else:
    print(999)


"""
A問題_103_Task Scheduling Problem・・・解けた
難易度65
3! = 6通りあるが、
最大値ー最小値が答え
"""

# 場合分け
A1, A2, A3 = map(int, input().split())
a = abs(A1 - A2) + abs(A1 - A3)
b = abs(A1 - A2) + abs(A2 - A3)
c = abs(A1 - A3) + abs(A2 - A3)
print(min(a, b, c))


# 最大値ー最小値
A = list(map(int, input().split()))
print(max(A) - min(A))


"""
A問題_102_Multiple of 2 and N・・・解けた
難易度29

２とNの最小公倍数を求める問題
Nが偶奇に着目すると、最小公倍数求めなくても最小公倍数が求まる

偶数：N
奇数：2N
"""

import math

N = int(input())
print(math.lcm(2, N))

N = int(input())
print(N if N % 2 == 0 else 2 * N)


"""
A問題_100_Happy Birthday!・・・解けない
(https://atcoder.jp/contests/abc100/tasks/abc100_a)
難易度57

16等分のケーキを食べるときに２人で分けると、
16 / 2 = 8、1人8個まで選べる

１人最大8個以下までは、隣り合わずケーキを食べられる
"""

A, B = map(int, input().split())
print("Yay!" if A <= 8 and B <= 8 else ":(")


"""
A問題_096_DayOfTakahashi・・・解けた
難易度87

(https://atcoder.jp/contests/abc096/tasks/abc096_a)

2018年1月1日から2018年a月b日までゾロ目になる日が何回あるか
"""

a, b = map(int, input().split())
if a <= b:
    print(a)
else:
    print(a - 1)


"""
B問題_086_1 21・・・解けた
難易度109

平方数＝√を外した値
例）
121=√121=11

11**2＝121

**0.5＝√に変換
"""

a, b = map(int, input().split())
c = int(int(str(a) + str(b)) ** 0.5)
print("Yes" if int(str(a) + str(b)) == c * c else "No")


"""
B問題_088_Harshad Number・・・解けた
難易度88

桁の総和、分解
文字列の操作
"""

N = input()
f_x = sum(list(map(int, N)))
print("Yes" if int(N) % f_x == 0 else "No")

"""
A問題_077_Rotation・・・解けた
難易度83

文字列を逆順にする＝180度回転させルコとと同じ
S[0],S[1],S[2]
T[0],T[1],T[2]

180度回転後
S[2],S[1],S[0]
T[2],T[1],S[0]

180度回転し等しいかの判定
S[0] = T[2] && S[1 = T[1] && S[2] = T[0]
"""

S = input()
T = input()
print("YES" if S[::-1] == T else "NO")


"""
A問題_06_Expired・・・解けた
難易度146

賞味期限を0日目の基準日として考える

場合分け
賞味期限内：
賞味期限切れだがX日未満
賞味期限切れかつX日以上経過している

X = 賞味期限切れでも食べられる上限日
A = 賞味期限
B = 買ってから食べた日
"""

X, A, B = map(int, input().split())
if B <= A < X:
    print("delicious")  # B - A <= 0
elif B - A <= X:
    print("safe")
else:
    print("dangerous")


"""
B問題_アイスクリーム (Ice Cream) 
切り上げ処理の問題

(A±B-1)//B
"""

S = int(input())
A = int(input())
B = int(input())


# 切り上げ処理
need = 0
if S >= A:
    need = (S - A + B - 1) // B
print(250 + 100 * need)

# シミュレーション
ans = 250
if S > A:
    for _ in range(A, S + 1):
        ans += 100
        A += B
        if A >= S:
            break
print(ans)


"""
A問題_Xに最も近い値
難しい
X,L,Rの位置を数直線で考える
"""

X, L, R = map(int, input().split())

if X < L:
    print(L)
elif R < X:
    print(R)
else:
    print(X)

# 冗長な解法
if L < R <= X:
    print(R)
elif X <= L < R:
    print(L)
elif L <= X < R:
    print(X)
else:
    print(L)


"""
D問題_284_Happy New Year 2023・・・解けない
難易度658

素因数分解
"""

T = int(input())
for i in range(T):
    N = int(input())
    p = 2
    while p * p <= N:
        if N % p == 0:
            N //= p
            break
        p += 1
    if N % p == 0:
        print(p, N // p)
    else:
        print(int(N**0.5), p)


"""
問題011_PrintPrimeNumbers・・・解けた
難易度6Q
アルゴリズム×数学

N以下の素数を求める

素数とは
・1と自分自身の数でしか割れない数＝約数が２個
"""

N = int(input())


def is_prime(n):
    """素数を判定"""
    for i in range(2, n):
        if n % i == 0:
            return False
    return True


for i in range(2, N + 1):
    if is_prime(i):
        print(i)

"""
問題_012_Primality Test・・・解けた
難易度５Q

素数判定
Nが素数であるかどうかを判定

2..√N回の範囲を回す(自分自身を含めない)
"""

N = int(input())
for i in range(2, int(N**0.5)):
    if N % i == 0:
        print("No")
        exit()
print("Yes")


"""
問題013_Divisor Enumeration
難易度5Q

約数列挙
"""


N = int(input())
ans = []
# 1..√N回まわる
for i in range(1, int(N**0.5) + 1):
    if N % i != 0:
        continue
    ans.append(N // i)
    if N // i != i:
        ans.append(i)
print(*sorted(ans), sep="\n")


"""
問題014_Factorization・・・ギリ解けた
難易度5Q

計算量：O(√N）
素因数分解

素数で割れるまで繰り返す＝素因数分解
Nが1で終わらないケースは、素数で割れるため、
末尾にNを追加することで素因数分解できる

例）N=10
2 * 5 = 10としたい
10 % 2 = 0
5 % 2 割れない
5 % 3 割れない

この時点でのN=5は2以上だから
Nを追加
"""

N = int(input())

ans = []
for i in range(2, int(N**0.5) + 1):
    while N % i == 0:
        ans.append(i)
        N //= i
# 最後の数を追加
if N >= 2:
    ans.append(N)
print(*ans)


"""
問題C_数を3つ数えるマン・・・解けた
難易度466

組合せ

異なるn個の中から3つを選ぶ
nC3通り試す

1 ≦ A < B < C < D < E ≦ 100

1番目に大きい値 C + D + E
2番目に大きい値 B + D + E
★3番目に大きい値 B + C + E, A + D + E

"""

# ベストプラクティス
A, B, C, D, E = map(int, input().split())
print(max(A + D + E, B + C + E))

# 全探索
A = list(map(int, input().split()))
N = len(A)
st = set()
for i in range(N):
    for j in range(i + 1, N):
        for k in range(j + 1, N):
            st.add(A[i] + A[j] + A[k])
print(sorted(st, reverse=True)[2])


"""
A問題_021_足し算・・・頭使う
N個の1を表示すれば正解
"""

N = int(input())
ans = [1] * N
print(N, *ans, sep="\n")


"""
B問題_013_錠・・・解けた
難易度293

aからbへの距離は？
リング上の円で考える

時計回り：＋１
反時計回り：ー1

aからbまでの距離の差は
0〜9までの10個の数字
min(abs(a - b), 10 - abs(a - b))

境界は
a < b b-a <= 5
a > b a-a <= 5


"""

a, b = int(input()), int(input())

# ベストプラクティス
diff = abs(a - b)
print(min(abs(a - b), 10 - diff))

# ダメな解法
ans = 0
if a < b:
    if b - a <= 5:
        ans = b - a
    else:
        ans = 9 % (b - a) + 1
else:
    if a - b <= 5:
        ans = a - b
    else:
        ans = 9 % (a - b) + 1
print(ans)


"""
A問題_033_隠れた言葉・・・解けた
難易度65

部分文字列の個数

N(N + 1)//2
"""

N = int(input())
print(N * (N + 1) // 2)


"""
A問題_434_Balloon Trip・・・解けた
難易度8Q

風船を飛ばすに為に必要なnの最低個数
1000w < nB
両辺にBをかけて式変形しnを求める

1000w / b < n
n = 1000w / b + 1（整数除算）
"""

W, B = map(int, input().split())
print((1000 * W) // B + 1)


"""
A問題_318_Full Moon・・・数学的解法で解けない
難易度14

全体分のM日目を引いて最初の0開始にする、N日目からM日目を引く N - M
残りのN日の中でP日見れる個数 N // P
+ 1＝最初の日を含める
(N - M) // P + 1
"""


N, M, P = map(int, input().split())

# 数学的解法 0(1)
print(max(0, (N - M) // P + 1))

count = 0
# シミュレーション
while M <= N:
    M += P
    count += 1
print(count)


"""
A問題_Odds of Oddness・・・解けた
奇数の個数を求める
N + 1 // 2 = 奇数の個数
"""
N = int(input())
print(((N + 1) // 2) / N)

"""
A問題_Pair・・・解けない
難易度25

K以下の偶数,奇数の組の個数を求める

偶数：a = k / 2
奇数：k - a
"""

K = int(input())
a = K // 2  # 偶数の個数
b = K - a  # 奇数の個数
print(a * b)


"""
B問題_JOI ソート (JOI Sort)・・・解けた
難易度7Q
"""

N = int(input())
S = sorted(input(), reverse=True)
si = 0
for i in range(N):
    if S[i] != "J":
        continue
    S[si], S[i] = S[i], S[si]
    si += 1
print("".join(S))


"""
N文字の数え上げ

1. 基本の考え方

文字列の長さが N で、使われる文字は任意の数 K とします。
重複あり／なしでパターンを数えるとき、ポイントは以下です：

文字の種類（distinct characters）を数える
各種類の出現数パターンを考える
順列の公式を使って通り数を計算

N文字で、文字の種類が M 個の場合：
全部同じ文字 → 1通り
1種類だけ複数、他は1回ずつ → 多重順列で計算
全て違う文字 → N! 通り
"""


"""
B問題_081_Shift_only・・・解けた
難易度143

全ての整数が偶数ではなくなるまで繰り返す
"""


def shift_only(N: int, A: list, count=0) -> int:
    while True:
        # 奇数が1つでもあれば終了
        if any(num % 2 != 0 for num in A):
            return count
        A = [num // 2 for num in A]
        count += 1


N, A = int(input()), map(int, input().split())
print(shift_only(N, list(A)))


N = int(input())
A = list(map(int, input().split()))
mx = max(A)
cur = 0
for i in range(mx - 1):
    if abs(A[i] - A[i + 1]) != 1:
        cur = i
        for j in range(A[i] + 1, A[i + 1]):
            cur += 1
            A.insert(cur, j)
        cur += 1
        if len(A) == cur + 1:
            break
        if A[cur] > A[cur + 1]:
            for k in range(A[cur] - 1, A[cur + 1], -1):
                cur += 1
                A.insert(cur, k)
print(*A)


"""
B問題_Fill the Gaps・・・解けた
難易度67

難しい
ループ回数がN回だと足りない
10**4程度回す必要あり
"""

N = int(input())
A = list(map(int, input().split()))
A += [0] * N
# ベストプラクティス
for i in range(10000):
    if A[i + 1] == 0:
        break
    if abs(A[i] - A[i + 1]) != 1:
        if A[i] < A[i + 1]:
            A.insert(i + 1, A[i] + 1)
        else:
            A.insert(i + 1, A[i] - 1)

print(*list(filter(lambda x: x, A)))

# 別解
ans = []
for i in range(N - 1):
    if A[i] < A[i + 1]:
        for j in range(A[i], A[i + 1]):
            ans.append(j)
    else:
        for j in range(A[i], A[i + 1], -1):
            ans.append(j)
ans.append(A[-1])
print(*ans)

"""
A問題_NotFound

差集合
"""

S = set(input())
T = set(chr(ord("a") + i) for i in range(26))
print(list(T - S)[0])


"""
JOI_D問題_二人三脚・・・解けた
6Q
"""

from collections import Counter

N = int(input())
A = list(map(int, input().split()))
counter = Counter(A)
print(sorted(counter.items(), key=lambda x: x[1])[0][0])


"""
B問題_348_Farthest Point・・・解けた
難易度79

２点間の最大の距離
ただし最大の距離が複数ある場合は点の番号が最も小さい点を出力
ユークリッド距離
√|x1 - x2|^2 + |y1- y2|^2
"""

N = int(input())
A = [tuple(map(int, input().split())) for _ in range(N)]


def dist(x1, y1, x2, y2):
    return ((x1 - x2) ** 2) + ((y1 - y2) ** 2) ** 0.5


for i in range(N):
    mx = 0
    ans = 0
    x1, y1 = A[i]
    for j in range(N):
        x2, y2 = A[j]
        d = dist(x1, y1, x2, y2)
        if mx < d:
            mx = d
            ans = j + 1
    print(ans)


"""
B問題_050_Contest with Drinks Easy・・・解けた
難易度235
難しい
リストの書き換え参照
"""

N = int(input())
T = list(map(int, input().split()))
M = int(input())
TT = T[:]
for i in range(M):
    p, x = map(int, input().split())
    p -= 1
    TT[p] = x
    print(sum(TT))
    TT = T[:]


"""
B問題_124_Great Ocean View・・・解けない
難易度69
(https://atcoder.jp/contests/abc124/tasks/abc124_b)

ひとつ個前の高さをMAXとして保持しておき状態を更新していく
"""

N = int(input())
H = list(map(int, input().split()))
ans = 0
current_max = 0
for i in range(N):
    if H[i] >= current_max:
        ans += 1
    if current_max < H[i]:
        current_max = H[i]
print(ans)


"""
JOIG_本選_過去問・・・解けた
難易度6Q

部分配列の更新＋全探索

1..N通り試し、0...N - i文字目を切り取りリストを更新
"""

N = int(input())
A = list(map(int, input().split()))

B = A[:]
for i in range(1, N):
    for j in range(N - i):
        B[j] = abs(B[j] - B[j + 1])
    B = B[0 : N - i]
print(*B)


"""
JOI_過去問_D問題_マラソン大会・・・解けた
難易度6Q
"""

N = int(input())
A = list(map(int, input().split()))

for i in range(N):
  rank = 1
  for j in range(N):
    if A[i] > A[j]:
      rank += 1
  print(rank)